In [27]:
import pandas as pd
import numpy as np

In [ ]:
x = pd.read_csv('salaries.csv')

In [ ]:
x

In [ ]:
x['phd'].quantile(0.3)

In [ ]:
 def pct40(col):
        return col.quantile(0.3)

In [ ]:
y = x[['phd', 'salary']].agg(pct40)

In [ ]:
y

In [ ]:
x.drop_duplicates(subset= ["sex","discipline"])

In [3]:
d = { "name" : ["Rob", "Rafiq", "Nina", "Sofia", "Mohan", "Tao", "Elon Musk"],
     "income" : [5000, 6000, 4000, 7500, 8000, 7000, 10000000]
    
}

In [32]:
df = pd.DataFrame(d)

In [33]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [18]:
percentile_99 = df.income.quantile(0.99)

In [25]:
df_no_outlier = df[df.income <= percentile_99]

In [26]:
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [24]:
df.income.quantile(0.25)

5500.0

In [34]:
df.income[3] = np.NaN

C:\Users\Adhiraj\AppData\Local\Temp\ipykernel_7844\2076340306.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.income[3] = np.NaN

In [35]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [39]:
df_new = df.fillna(df.income.median())

In [40]:
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0